In [66]:
import pandas as pd

data = {
    'Region': ['East', 'West', 'East', 'North', 'West', 'East'],
    'Sales': [200, 120, 340, 300, 250, 400],
    'Profit': [20, 15, 50, 30, 25, 60]
}

df = pd.DataFrame(data)
df

  Region  Sales  Profit
0   East    200      20
1   West    120      15
2   East    340      50
3  North    300      30
4   West    250      25
5   East    400      60

In [67]:
grouped = df.groupby('Region')['Sales'].sum()
grouped

Region
East     940
North    300
West     370
Name: Sales, dtype: int64

In [68]:
data = {
    'Region': ['East', 'East', 'West', 'West', 'North', 'North'],
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Sales': [200, 340, 120, 250, 300, 150]
}

df = pd.DataFrame(data)
df

  Region Product  Sales
0   East       A    200
1   East       B    340
2   West       A    120
3   West       B    250
4  North       A    300
5  North       B    150

In [69]:
df.groupby(['Region']).sum()

       Product  Sales
Region
East        AB    540
North       AB    450
West        AB    370

In [70]:
df.groupby(['Region', 'Product']).sum() # Grouping by Multiple Columns

                Sales
Region Product
East   A          200
       B          340
North  A          300
       B          150
West   A          120
       B          250

In [71]:
df.groupby(['Region', 'Sales']).sum() # Grouping by Multiple Columns

             Product
Region Sales
East   200         A
       340         B
North  150         B
       300         A
West   120         A
       250         B

In [72]:
for name, group in df.groupby('Region'):
    # print(name)
    print(group)

  Region Product  Sales
0   East       A    200
1   East       B    340
  Region Product  Sales
4  North       A    300
5  North       B    150
  Region Product  Sales
2   West       A    120
3   West       B    250

In [73]:
df.groupby('Region')['Sales'].mean()

Region
East     270.0
North    225.0
West     185.0
Name: Sales, dtype: float64

In [74]:
# df.groupby('Region').agg({'Sales': 'sum', 'Profit': 'mean'})

    Math  Science
s1  30.0       35
s2  40.0       45
s3  50.0       60
s4  60.0       70
55  70.0       25
66  80.0       80
s7   NaN       90

    Math  Science
s1  30.0       35
s2  40.0       45
s3  50.0       60
s4  60.0       70
55  70.0       25
66  80.0       80

In [92]:
df[~(df.Math<50)] # remove values from df.Math if it's < 50

    Math  Science
s3  50.0       60
s4  60.0       70
55  70.0       25
66  80.0       80
s7   NaN       90

In [95]:
df[~((df.Math<50) | (df.Science<50))] # remove values from df.Math if it's < 50

    Math  Science
s3  50.0       60
s4  60.0       70
66  80.0       80
s7   NaN       90

In [78]:
df.Math

s1    30.0
s2    40.0
s3    50.0
s4    60.0
55    70.0
66    80.0
s7     NaN
Name: Math, dtype: float64

In [79]:
df['Math']

s1    30.0
s2    40.0
s3    50.0
s4    60.0
55    70.0
66    80.0
s7     NaN
Name: Math, dtype: float64

In [80]:
type(df.Math)

pandas.core.series.Series

In [81]:
df.loc['s1']

Math       30.0
Science    35.0
Name: s1, dtype: float64

In [82]:
type(df.loc['s1'])

pandas.core.series.Series

In [ ]:
df